PetriSanti/TestProject/MKE06Z128xxx4_Project_Test/drivers/fsl_flash.c
    flash_cache_clear_process(config, kFLASH_CacheClearProcessPre);

    /* the start address will increment to the next sector address
     * until it reaches the endAdddress */
    while (start <= endAddress)
    {
        /* clear error flags */
        FTMRx->FSTAT = FTMRx_FSTAT_ACCERR_MASK | FTMRx_FSTAT_FPVIOL_MASK;
        /* preparing passing parameter to erase a flash block */
        /* Write index to specify the command code to be loaded */
        flash_set_command(0U, start >> 16, FTMRx_ERASE_SECTOR);

        /* Write index to specify the lower byte memory address bits[15:0] to be loaded */
        flash_set_command(1U, start, start >> 8);

        /* calling flash command sequence function to execute the command */
        returnCode = flash_command_sequence(config);

        /* calling flash callback function if it is available */
        if (config->PFlashCallback)
        {
            config->PFlashCallback();
        }

        /* checking the success of command execution */
        if (kStatus_FLASH_Success != returnCode)
        {
            break;
        }
        /* Increment to the next sector */
        start += sectorSize;
    }

    flash_cache_clear(config);

    return (returnCode);
}

#if defined(FSL_FEATURE_FLASH_HAS_UNSECURE_FLASH_CMD) && FSL_FEATURE_FLASH_HAS_UNSECURE_FLASH_CMD
status_t FLASH_EraseAllUnsecure(flash_config_t *config, uint32_t key)
{
    status_t returnCode;

    if (config == NULL)
    {
        return kStatus_FLASH_InvalidArgument;
    }

    /* Prepare passing parameter to erase all flash blocks (unsecure). */
    /* clear error flags */
    FTMRx->FSTAT = FTMRx_FSTAT_ACCERR_MASK | FTMRx_FSTAT_FPVIOL_MASK;

    /* Write index to specify the command code to be loaded */
    flash_set_command(0U, 0U, FTMRx_ERASE_ALL_BLOCK_UNSECURE);

    /* Validate the user key */
    returnCode = flash_check_user_key(key);
    if (returnCode)
    {
        return returnCode;
    }

    flash_cache_clear_process(config, kFLASH_CacheClearProcessPre);

    /* calling flash command sequence function to execute the command */
    returnCode = flash_command_sequence(config);

    flash_cache_clear(config);

    return returnCode;
}
#endif /* FSL_FEATURE_FLASH_HAS_UNSECURE_FLASH_CMD */

status_t FLASH_Program(flash_config_t *config, uint32_t start, uint32_t *src, uint32_t lengthInBytes)
{
    status_t returnCode;
    flash_operation_config_t flashOperationInfo;

    if (src == NULL)
    {
        return kStatus_FLASH_InvalidArgument;
    }

    flash_get_matched_operation_info(config, start, &flashOperationInfo);

    /* Check the supplied address range. */
    returnCode = flash_check_range(config, start, lengthInBytes, flashOperationInfo.blockWriteUnitSize);
    if (returnCode)
    {
        return returnCode;
    }

    flash_cache_clear_process(config, kFLASH_CacheClearProcessPre);

    while (lengthInBytes > 0)
    {
        /* pass paramters to FTMRx */
        FTMRx->FSTAT = FTMRx_FSTAT_ACCERR_MASK | FTMRx_FSTAT_FPVIOL_MASK;

        /* Write index to specify the command code to be loaded */
        flash_set_command(0U, start >> 16, FTMRx_PROGRAM);
        flash_set_command(1U, start, start >> 8);
        /*Small endian by default.*/
        /* Write index to specify the word0 (MSB word) to be programmed */
        flash_set_command(2U, *src, *src >> 8);

        /* Write index to specify the word1 (LSB word) to be programmed */
        flash_set_command(3U, *src >> 16, *src >> 24); 
        /* preparing passing parameter to program the flash block */
        
        if (4 == flashOperationInfo.blockWriteUnitSize)
        {
            /* calling flash command sequence function to execute the command */
            returnCode = flash_command_sequence(config);
        }
        else if (8 == flashOperationInfo.blockWriteUnitSize)
        {
            src++;
            /* Write index to specify the word (MSB word) to be programmed */
            flash_set_command(4U, *src, *src >> 8);
            /* Write index to specify the word (LSB word) to be programmed */
            flash_set_command(5U, *src >> 16, *src >> 24);

            /* calling flash command sequence function to execute the command */
            returnCode = flash_command_sequence(config);
            
        }
        else
        {
        }
        src++;
        /* calling flash callback function if it is available */
        if (config->PFlashCallback)
        {
            config->PFlashCallback();
        }

        /* checking for the success of command execution */
        if (kStatus_FLASH_Success != returnCode)
        {
            break;
        }
        else
        {
            /* update start address for next iteration */
            start += flashOperationInfo.blockWriteUnitSize;

            /* update lengthInBytes for next iteration */
            lengthInBytes -= flashOperationInfo.blockWriteUnitSize;
        }
    }

    flash_cache_clear(config);

    return (returnCode);
}

status_t FLASH_ProgramOnce(flash_config_t *config, uint32_t index, uint32_t *src, uint32_t lengthInBytes)
{
    status_t returnCode;

    if ((config == NULL) || (src == NULL))
    {
        return kStatus_FLASH_InvalidArgument;
    }

    /* pass paramters to FTMRx */
    FTMRx->FSTAT = FTMRx_FSTAT_ACCERR_MASK | FTMRx_FSTAT_FPVIOL_MASK;
    
    /* Write index to specify the command code to be loaded. */
    flash_set_command(0U, 0U, FTMRx_PROGRAM_ONCE);
    flash_set_command(1U, index, index >> 8);

    /* Write index to specify the word0 (MSB word) to be programmed. */
    flash_set_command(2U, *src, *src >> 8);

    /* Write index to specify the word1 (LSB word) to be programmed. */
    flash_set_command(3U, *src >> 16, *src >> 24);

#if FLASH_PROGRAM_ONCE_IS_8BYTES_UNIT_SUPPORT

    /* Write index to specify the word2 (MSB word) to be programmed. */
    flash_set_command(4U, *(src + 1), *(src + 1) >> 8);

    /* Write index to specify the word3 (LSB word) to be programmed. */
    flash_set_command(5U, *(src + 1) >> 16, *(src + 1) >> 24);
#endif
    flash_cache_clear_process(config, kFLASH_CacheClearProcessPre);

    /* calling flash command sequence function to execute the command */
    returnCode = flash_command_sequence(config);

