PetriSanti/TestProject/MKE06Z128xxx4_Project_Test/drivers/fsl_flash.c
    flash_cache_clear(config);

    return returnCode;
}

#if FLASH_SSD_IS_EEPROM_ENABLED
status_t FLASH_EepromWrite(flash_config_t *config, uint32_t start, uint8_t *src, uint32_t lengthInBytes)
{
    status_t returnCode;
    uint32_t i;
    if ((config == NULL)|| (src == NULL))
    {
        return kStatus_FLASH_InvalidArgument;
    }
    if ((lengthInBytes > 4) || (0 == lengthInBytes))
    {
        return kStatus_FLASH_InvalidArgument;
    }

    /* Check the supplied address range. */
    /* Validates the range of the given address */
    if ((start < config->EEpromBlockBase) ||
        ((start + lengthInBytes) > (config->EEpromBlockBase + config->EEpromTotalSize)))
    {
        return kStatus_FLASH_AddressError;
    }

    returnCode = kStatus_FLASH_Success;

    flash_cache_clear_process(config, kFLASH_CacheClearProcessPre);

    while (lengthInBytes > 3)
    {
        /* pass paramters to FTMRx */
        FTMRx->FSTAT = FTMRx_FSTAT_ACCERR_MASK | FTMRx_FSTAT_FPVIOL_MASK;

        /* Write index to specify the command code to be loaded */
        flash_set_command(0U, start >> 16, FTMRx_PROGRAM_EEPROM);
        flash_set_command(1U, start, start >> 8);

        /* Write index to specify the byte (MSB word) to be programmed */
        for (i = 0; i < lengthInBytes; i++)
        {
            flash_set_command(0x02U + i, *src++, 0U);
        }

        /* calling flash command sequence function to execute the command */
        returnCode = flash_command_sequence(config);

        /* calling flash callback function if it is available */
        if (config->PFlashCallback)
        {
            config->PFlashCallback();
        }

        /* checking for the success of command execution */
        if (kStatus_FLASH_Success != returnCode)
        {
            break;
        }
        else
        {
            /* update start address for next iteration */
            start += 4U;
            src += 4U;
            /* update lengthInBytes for next iteration */
            lengthInBytes -= 4U;
        }
    }
    if ((lengthInBytes > 0) && (kStatus_FLASH_Success == returnCode))
    {
        /* pass paramters to FTMRx */
        FTMRx->FSTAT = FTMRx_FSTAT_ACCERR_MASK | FTMRx_FSTAT_FPVIOL_MASK;

        /* Write index to specify the command code to be loaded */
        flash_set_command(0U, start >> 16, FTMRx_PROGRAM_EEPROM);
        flash_set_command(1U, start, start >> 8);

        /* Write index to specify the byte (MSB word) to be programmed */
        for (i = 0; i < lengthInBytes; i++)
        {
            flash_set_command(0x02U + i, *src++, 0U);
        }
        /* calling flash command sequence function to execute the command */
        returnCode = flash_command_sequence(config);
    }
    flash_cache_clear(config);

    return (returnCode);
}
#endif /* FLASH_SSD_IS_EEPROM_ENABLED */

status_t FLASH_ReadOnce(flash_config_t *config, uint32_t index, uint32_t *dst, uint32_t lengthInBytes)
{
    status_t returnCode;

    if ((config == NULL) || (dst == NULL))
    {
        return kStatus_FLASH_InvalidArgument;
    }
    
    flash_cache_clear_process(config, kFLASH_CacheClearProcessPre);
    /* clear error flags */
    FTMRx->FSTAT = FTMRx_FSTAT_ACCERR_MASK | FTMRx_FSTAT_FPVIOL_MASK;

    /* Write index to specify the command code to be loaded */
    flash_set_command(0U, 0U, FTMRx_READ_ONCE);
    flash_set_command(1U, index, index >> 8);

    /* calling flash command sequence function to execute the command */
    returnCode = flash_command_sequence(config);

    if (kStatus_FLASH_Success == returnCode)
    {
        /* Read lengthInBytes words. */
        FTMRx->FCCOBIX = FTMRx_FCCOBIX_CCOBIX(2U);
        *dst = (uint32_t)BYTES_JOIN_TO_WORD_1_1(FTMRx->FCCOBLO, FTMRx->FCCOBHI);
        FTMRx->FCCOBIX = FTMRx_FCCOBIX_CCOBIX(3U);
        *dst |= ((uint32_t)BYTES_JOIN_TO_WORD_1_1(FTMRx->FCCOBLO, FTMRx->FCCOBHI)) << 16;
#if FLASH_PROGRAM_ONCE_IS_8BYTES_UNIT_SUPPORT
        FTMRx->FCCOBIX = FTMRx_FCCOBIX_CCOBIX(4U);
        *(dst + 1) = (uint32_t)BYTES_JOIN_TO_WORD_1_1(FTMRx->FCCOBLO, FTMRx->FCCOBHI);
        FTMRx->FCCOBIX = FTMRx_FCCOBIX_CCOBIX(5U);
        *(dst + 1) |= ((uint32_t)BYTES_JOIN_TO_WORD_1_1(FTMRx->FCCOBLO, FTMRx->FCCOBHI)) << 16;
#endif
    }
    flash_cache_clear(config);

    return returnCode;
}

status_t FLASH_GetSecurityState(flash_config_t *config, flash_security_state_t *state)
{
    /* store data read from flash register */
    uint8_t registerValue;

    if ((config == NULL) || (state == NULL))
    {
        return kStatus_FLASH_InvalidArgument;
    }

    /* Get flash security register value */
    registerValue = FTMRx->FSEC;

    /* check the status of the flash security bits in the security register */
    if (FLASH_SECURITY_STATE_UNSECURED == (registerValue & FTMRx_FSEC_SEC_MASK))
    {
        /* Flash in unsecured state */
        *state = kFLASH_SecurityStateNotSecure;
    }
    else
    {
        /* Flash in secured state
         * check for backdoor key security enable bit */
        if (FLASH_SECURITY_STATE_KEYEN == (registerValue & FTMRx_FSEC_KEYEN_MASK))
        {
            /* Backdoor key security enabled */
            *state = kFLASH_SecurityStateBackdoorEnabled;
        }
        else
        {
            /* Backdoor key security disabled */
            *state = kFLASH_SecurityStateBackdoorDisabled;
        }
    }

    return (kStatus_FLASH_Success);
}

status_t FLASH_SecurityBypass(flash_config_t *config, const uint8_t *backdoorKey)
{
    uint8_t registerValue; /* registerValue */
    status_t returnCode;   /* return code variable */
    uint8_t tmpKey;
    uint8_t i;

    if ((config == NULL) || (backdoorKey == NULL))
    {
        return kStatus_FLASH_InvalidArgument;
    }

    /* set the default return code as kStatus_Success */
    returnCode = kStatus_FLASH_Success;

    /* Get flash security register value */
    registerValue = FTMRx->FSEC;

