PetriSanti/TestProject/MKE06Z128xxx4_Project_Test/drivers/fsl_flash.c
    /* Check to see if flash is in secure state (any state other than 0x2)
     * If not, then skip this since flash is not secure */
    if (0x02 != (registerValue & 0x03))
    {
        
        /* clear error flags */
        FTMRx->FSTAT = FTMRx_FSTAT_ACCERR_MASK | FTMRx_FSTAT_FPVIOL_MASK;
        /* preparing passing parameter to erase a flash block */
        /* Write index to specify the command code to be loaded */
        flash_set_command(0U, 0U, FTMRx_SECURITY_BY_PASS);
    
        for(i = 0; i < 4; i++)
        {
            tmpKey = *backdoorKey++;
            flash_set_command(i + 1U, tmpKey, *backdoorKey++);
        }

        /* calling flash command sequence function to execute the command */
        returnCode = flash_command_sequence(config);
    }

    return (returnCode);
}

status_t FLASH_VerifyEraseAll(flash_config_t *config, flash_margin_value_t margin)
{
    status_t returnCode;
    if (config == NULL)
    {
        return kStatus_FLASH_InvalidArgument;
    }
    /* set the default return code as kStatus_Success */
    returnCode = kStatus_FLASH_Success;

    if (margin != config->PFlashMarginLevel)
    {
        switch(margin)
        {
            case kFLASH_MarginValueUser:
                returnCode = flash_setusermarginlevel(config, config->PFlashBlockBase, 0U, kFLASH_UserMarginValue1);
                break;
            case kFLASH_MarginValueFactory:
                returnCode = flash_setfactorymarginlevel(config, config->PFlashBlockBase, 0U, kFLASH_FactoryMarginValue1);
                break;
            case kFLASH_MarginValueNormal:
                returnCode = flash_setusermarginlevel(config, config->PFlashBlockBase, 0U, kFLASH_ReadMarginValueNormal);
                break;
            default:
                returnCode = kStatus_FLASH_InvalidArgument;
                break;
        }
        config->PFlashMarginLevel = margin;
    }
    if (returnCode)
    {
        return returnCode;
    }
#if FLASH_SSD_IS_EEPROM_ENABLED
    if (margin != config->PFlashMarginLevel)
    {
        switch(margin)
        {
            case kFLASH_MarginValueUser:
                returnCode = flash_setusermarginlevel(config, config->EEpromBlockBase, 1U, kFLASH_UserMarginValue1);
                break;
            case kFLASH_MarginValueFactory:
                returnCode = flash_setfactorymarginlevel(config, config->EEpromBlockBase, 1U, kFLASH_FactoryMarginValue1);
                break;
            case kFLASH_MarginValueNormal:
                returnCode = flash_setusermarginlevel(config, config->EEpromBlockBase, 1U, kFLASH_ReadMarginValueNormal);
                break;
            default:
                returnCode = kStatus_FLASH_InvalidArgument;
                break;
        }
        config->PFlashMarginLevel = margin;
    }
    if (returnCode)
    {
        return returnCode;
    }
#endif

    /* clear error flags */
    FTMRx->FSTAT = FTMRx_FSTAT_ACCERR_MASK | FTMRx_FSTAT_FPVIOL_MASK;
     
    /* Erase verify all flash & EEPROM blocks */
    flash_set_command(0U, 0U, FTMRx_ERASE_VERIFY_ALL_BLOCK);
    
    returnCode = flash_command_sequence(config);

    return returnCode;
}

status_t FLASH_VerifyErase(flash_config_t *config, uint32_t start, uint32_t lengthInBytes, flash_margin_value_t margin)
{
    uint32_t blockSize;
    flash_operation_config_t flashOperationInfo;
    uint32_t nextBlockStartAddress;
    uint32_t remainingBytes;
    status_t returnCode;

    flash_get_matched_operation_info(config, start, &flashOperationInfo);

    returnCode = flash_check_range(config, start, lengthInBytes, flashOperationInfo.sectionCmdAddressAligment);
    if (returnCode)
    {
        return returnCode;
    }

    flash_get_matched_operation_info(config, start, &flashOperationInfo);
    start = flashOperationInfo.convertedAddress;
    blockSize = flashOperationInfo.activeBlockSize;

    nextBlockStartAddress = ALIGN_UP(start, blockSize);
    if (nextBlockStartAddress == start)
    {
        nextBlockStartAddress += blockSize;
    }

    remainingBytes = lengthInBytes;

    while (remainingBytes)
    {
        uint32_t numberOfPhrases;
        uint32_t verifyLength = nextBlockStartAddress - start;
        if (verifyLength > remainingBytes)
        {
            verifyLength = remainingBytes;
        }
        numberOfPhrases = verifyLength >> flashOperationInfo.sectionCmdAddressAligment;
        if (margin != config->PFlashMarginLevel)
        {
            switch(margin)
            {
                case kFLASH_MarginValueUser:
                    returnCode = flash_setusermarginlevel(config, start, 0U, kFLASH_UserMarginValue1);
                    break;
                case kFLASH_MarginValueFactory:
                    returnCode = flash_setfactorymarginlevel(config, start, 0U, kFLASH_FactoryMarginValue1);
                    break;
                case kFLASH_MarginValueNormal:
                    returnCode = flash_setusermarginlevel(config, start, 0U, kFLASH_ReadMarginValueNormal);
                    break;
                default:
                    returnCode = kStatus_FLASH_InvalidArgument;
                    break;
            }
            config->PFlashMarginLevel = margin;
        }
        if (returnCode)
        {
            return returnCode;
        }
        flash_cache_clear_process(config, kFLASH_CacheClearProcessPre); 
        /* clear error flags */
        FTMRx->FSTAT = FTMRx_FSTAT_ACCERR_MASK | FTMRx_FSTAT_FPVIOL_MASK;

        /* Fill in verify FLASH section command parameters. */
        flash_set_command(0U, start >> 16, FTMRx_ERASE_VERIFY_SECTION);
        flash_set_command(1U, start, start >> 8);
        /* Write index to specify the # of longwords to be verified */
        flash_set_command(2U, numberOfPhrases, numberOfPhrases >> 8);

        /* calling flash command sequence function to execute the command */
        returnCode = flash_command_sequence(config);
        if (returnCode)
        {
            return returnCode;
        }

        remainingBytes -= verifyLength;
        start += verifyLength;
        nextBlockStartAddress += blockSize;
    }

